# what is pandas

pandas is a python library used

# Importing pandas

In [2]:
import pandas as pd
import numpy as np
pd.__version__

'2.0.3'

# Pandas data structure::

# series- one dimensional column
# DataFrame-Table with rows+columns

In [3]:
s=pd.Series([10,20,30])
s

0    10
1    20
2    30
dtype: int64

In [4]:
df=pd.DataFrame({
    "name":["Neelima","Akhila"],
    "Age":[20,19],
    "Location":["kakinadaa","Pithapuram"]})
df

      name  Age    Location
0  Neelima   20   kakinadaa
1   Akhila   19  Pithapuram

# Reading Data(CSV)

In [6]:
df=pd.DataFrame({
    "name":["Akhila","Sahithi","Akhila","neelima"],
    "age":[91,23,91,23]})
df

      name  age
0   Akhila   91
1  Sahithi   23
2   Akhila   91
3  neelima   23

In [7]:
df.duplicated()

0    False
1    False
2     True
3    False
dtype: bool

In [10]:
df[df.duplicated()]

     name  age
2  Akhila   91

In [11]:
df=df.drop_duplicates()
df

      name  age
0   Akhila   91
1  Sahithi   23
3  neelima   23